#### BuiltInFailures.SpanDirectionSymbolFailures Members

---

|  |
| --- |
| BuiltInFailures SpanDirectionSymbolFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SpanDirectionSymbolFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | NonPlanView | Span Direction Symbol can only be placed in a Floor Plan View. |

# See Also

BuiltInFailures SpanDirectionSymbolFailures Class

Autodesk.Revit.DB Namespace